<!DOCTYPE html>
<meta charset=utf-8>
<title>Installation de Python - Plongez au c&oelig;ur de Python 3</title>
<!--[if IE]><script src=j/html5.js></script><![endif]-->
<link rel=stylesheet href=dip3.css>
<style>
body{counter-reset:h1 0}
.i{list-style:none;margin:0;padding:0}
#which{padding-top:1.75em}
h2,.i>li{clear:both}
#divingin,#which{clear:none}
</style>
<link rel=stylesheet media='only screen and (max-device-width: 480px)' href=mobile.css>
<link rel=stylesheet media=print href=print.css>
<meta name=viewport content='initial-scale=1.0'>
<form action=http://www.google.com/cse><div><input type=hidden name=cx value=014021643941856155761:l5eihuescdw><input type=hidden name=ie value=UTF-8>&nbsp;<input type=search name=q size=25 placeholder="powered by Google&trade;">&nbsp;<input type=submit name=sa value=Rechercher></div></form>
<p>Vous &ecirc;tes Ici : <a href=index.html>Accueil</a> <span class=u>&#8227;</span> <a href=table-of-contents.html#installing-python>Plongez au c&oelig;ur de Python 3</a> <span class=u>&#8227;</span>
<p id=level>Niveau de difficult&eacute;e : <span class=u title=novice>&#x2666;&#x2662;&#x2662;&#x2662;&#x2662;</span>
<h1>Installation de Python</h1>
<blockquote class=q>
<p><span class=u>&#x275D;</span> <i lang=la>Tempora mutantur nos et mutamur in illis.</i> (Les temps changent, et nous changeons avec eux.) <span class=u>&#x275E;</span><br>&mdash; vieux proverbe Romain
</blockquote>
<p id=toc>&nbsp;
<h2 id=divingin>Lan&ccedil;ons Nous</h2>
<p class=f>Avant de pouvoir commencer &agrave; programmer avec Python 3, vous devez l&#8217;installer. Ou pas ?

<h2 id=which>Quel Python est votre Python ?</h2>

<p>Si vous utilisez un compte sur un serveur d&#8217;h&eacute;bergement, votre h&eacute;bergeur a peut-&ecirc;tre d&eacute;j&agrave; install&eacute; Python 3. Si vous utilisez Linux &agrave; la maison, you avez peut-&ecirc;tre aussi d&eacute;j&agrave; Python 3. La plupart des distributions GNU/Linux embarquent Python 2 par d&eacute;faut; un petit nombre de distributions incluent Python 3 et cette tendance s&#8217;acc&eacute;l&egrave;re. Mac OS X inclue une version en ligne de commande de Python2, but au moment o&ugrave; ce livre s&#8217;&eacute;crit il n&#8217;inclue pas Python 3. Quant &agrave; Microsoft Windows il n&#8217;inclue aucune version de Python. Mais pas d&#8217;affolement ! Il est toujours possible d&#8217;installer Python en quelques cliques, peu importe le syst&egrave;me d&#8217;exploitation que vous utilisez.

<p>La mani&egrave;re la plus simple pour v&eacute;rifier si Python 3 est sur votre Linux ou votre Mac OS X est <a href=troubleshooting.html#getting-to-the-command-line>d&#8217;acc&eacute;der à la ligne de commande</a>. Une fois que vous avez atteint la ligne de commande de votre syst&egrave;me, tappez juste <kbd>python3</kbd> (tout en minuscule, sans espaces), appuyer sur la touche <kbd>ENTRER</kbd>, et regarder ce qui se passe. Sur mon ordinateur sous Linux, Python 3.1 est d&eacute;j&agrave; install&eacute;, et cette commande m&#8217;envoit dans le <i><dfn>shell interactif</dfn> de Python</i>.

<pre class='nd screen cmdline'>
<samp class=p>mark@atlantis:~$ </samp><kbd>python3</kbd>
<samp>Python 3.1 (r31:73572, Jul 28 2009, 06:52:23) 
[GCC 4.2.4 (Ubuntu 4.2.4-1ubuntu4)] on linux2
Type "help", "copyright", "credits" or "license" for more information.
>>></samp></pre>

<p>(Tappez <kbd>exit()</kbd> et appuyez sur <kbd>ENTRER</kbd> pour sortir du shell interactif de Python.)

<p>Mon <a href=http://cornerhost.com/>h&eacute;bergeur</a> tourne aussi sous Linux et me donne l'acc&egrave;s &agrave; une ligne de commande, mais mon serveur ne poss&egrave;de pas Python 3 d&#8217;install&eacute;. (Sniff!)

<pre class='nd screen cmdline'>
<samp class=p>mark@manganese:~$ </samp><kbd>python3</kbd>
<samp>bash: python3: command not found</samp></pre>

<p>Donc pour en revenir &agrave; la question initiale, &#8220;Quel Python est votre Python ?&#8221;  Celui qui tourne sur l&#8217;ordinateur que vous avez d&eacute;j&agrave;.

<p>[Lisez cette partie pour l&#8217;installation sous Windows, ou passez &agrave; la section <a href=#macosx>Installation sous Mac OS X</a>, <a href=#ubuntu>Installation sous Ubuntu Linux</a>, ou <a href=#other>Installation sous d&#8217;Autres Plateformes</a>.]

<p class=a>&#x2042;

<h2 id=windows>Installation sous Microsoft Windows</h2>

<p>Windows vient sous deux formes d&#8217;architectures ces temps-ci: 32-bit et 64-bit. Bien s&ucirc;r, il y a beaucoup de diff&eacute;rences entre les <i>versions</i> Windows&nbsp;&mdash;&nbsp;XP, Vista, Windows 7&nbsp;&mdash;&nbsp;mais Python tourne indiff&eacute;rement sur toutes ces versions. La plus importante distinction vient de l&#8217;architecture entre 32-bit et 64-bit. Si vous n&#8217;avez aucune id&eacute;e de l&#8217;architecture que vous utilisez, alors c&#8217;est probablement du 32-bit.

<p>Allez sur <a href=http://python.org/download/><code>python.org/download/</code></a> et t&eacute;l&eacute;chargez la version appropri&eacute;e de Python 3  pour votre architecture. Vos choix possibles ressembleront &agrave; quelque chose comme &ccedil;a :

<ul>
<li><b>Python 3.1 Windows installer</b> (Windows binary&nbsp;&mdash;&nbsp;does not include source)
<li><b>Python 3.1 Windows AMD64 installer</b> (Windows AMD64 binary&nbsp;&mdash;&nbsp;does not include source)
</ul>

<p>Je refuse d&#8217;inclure un lien direct sur cette page, car des mise &agrave; jour mineure arrivent tout le temps et je ne veux pas &ecirc; accuser de vous avoir faire manquer une mise &agrave; jour importante. Vous devez toujours installer la plus r&eacute;cente version de Python 3.X sauf si vous poss&egrave;dez une bonne raison esoth&eacute;rique de ne pas le faire.

<ol class=i>
<li>
<p class='ss nm'><img src=i/win-install-0-security-warning.png width=409 height=309 alt='[Windows dialog: open file security warning]'>
<p>Une fois votre t&eacute;l&eacute;chargement termin&eacute;, double-cliquez sur le fichier <code>.msi</code>. Windows va ouvrir une alerte de s&eacute;curit&eacute;, vu que vous &ecirc;tes sur le point d&#8217;ex&eacute;cuter un programme. L&#8217;installeur officiel de Python poss&egrave;de une signature digitale sign&eacute;e par la <a href=http://www.python.org/psf/>Python Software Foundation</a>, l&#8217;organisation &agrave; but non-commerciale qui g&egrave;re le d&eacute;veloppement de Python. Refusez toute imitations !
<p>Cliquez sur le bouton <code>Ex&eacute;cuter</code> pour lan&ccedil;er l&#8217;installation de Python 3.

<li>
<p class='ss nm'><img src=i/win-install-1-all-users-or-just-me.png width=499 height=432 alt='[Python installer: select whether to install Python 3.1 for all users of this computer]'>
<p>La premi&egrave;re question que l&#8217;;installeur va vous poser est si vous souhaitez installer Python 3 pour tous les utilisateurs ou juste pour vous. Le choix par d&eacute;faut propose de &#8220;l&#8217;installer pour tous les utilisateurs,&#8221; ce qui est le meilleur choix sauf si vous avez une bonne raison pour ne pas vouloir. (Une bonne raison pour &#8220;installer juste pour vous&#8221; est si vous installer Python sur l&#8217;ordinateur de votre soci&eacute;t&eacute; et que vous n&#8217;avez pas les droit d&#8217;administrateur sur votre compte Windows. Mais si c&#8217;est vraiment le cas, pourquoi donc installez-vous Python sans la permission de votre administrateur Windows ? A la r&eacute;flexion, je ne veux pas savoir ! Je ne veux pas d&#8217;ennuis !)
<p>Cliquez sur le bouton <code>Suivant</code> pour valider votre type d&#8217;installation.

<li>
<p class='ss nm'><img src=i/win-install-2-destination-directory.png width=499 height=432 alt='[Python installer: select destination directory]'>
<p>Ensuite, l&#8217;installeur va vous demander de choisir une destination o&ugrave; installer Python 3. L&#8217;emplacement par d&eacute;faut de toutes les versions de Python 3.1.x est <code>C:\Python31\</code>, ce qui devrait fonctionner pour la plupart des utilisateurs lambda sauf si une raison sp&eacute;cifique vous demande de changer cet emplacement. Si vous avez d&eacute;finit une partition annexe pour installer certaines applications (e.g. <code>D:</code>), vous pouvez s&eacute;lectionner ce chemin avec les boutons de l&#8217;interface graphique, ou simplement entrer le chemin en toute lettre au clavier. Vous n&#8217;&ecirc;tes donc pas forc&eacute; d&#8217;installer Python sur le lecteur <code>C:</code>; vous pouvez l'installer sur n'importe quel lecteur et dans n'importe quel dossier.
<p>Cliquez sur le bouton <code>Suivant</code> pour valider votre destination d&#8217;installation.

<li>
<p class='ss nm'><img src=i/win-install-3-customize.png width=499 height=432 alt='[Python installer: customize Python 3.1]'>
<p>La page suivante semble compliqu&eacute;e mais ne l&#8217;est pas vraiment. Comme avec beaucoup d&#8217;installeurs, vous avez la possibilit&eacute; de ne pas installer tous les composants de Python 3. Ainsi si votre espace disque disponible est tr&egrave;s faible, vous pouvez exclure de l&#8217;installation certains composants.
<ul>
<li>L&#8217;option <b>Register Extensions</b> vous permet de double-cliquer sur des scripts Python (fichiers <code>.py</code>) pour les ex&eacute;cuter. Elles est recommand&eacute; mais non n&eacute;cessaire. (Cette option ne consomme pas d&#8217;espace disque, il y a donc peu d&#8217;int&eacute;r&ecirc;t &agrave; l&#8217;exclure de l&#8217;installation.)
<li><b>Tcl/Tk</b> est la biblioth&egrave;que graphique utilis&eacute;e par le shell Python, que nous allons utiliser &agrave; travers cet ouvrage. Je recommande tr&egrave;s fortement de conserver cette option.
<li>L&#8217;option <b>Documentation</b> installe des fichiers d&#8217;aide qui contiennent presque autant d&#8217;informations que <a href=http://docs.python.org/><code>docs.python.org</code></a>. Cette option est recommand&eacute; surtout si votre acc&egrave;s &agrave; Internet est limit&eacute;.
<li>L&#8217;option <b>Utility Scripts</b> inclue le tr&egrave;s utile script <code>2to3.py</code> dont nous allons apprendre l&#8217;utilisation <a href=case-study-porting-chardet-to-python-3.html>plus tard dans cet ouvrage</a>. Cette option est n&eacute;cessaire si vous voulez apprendre &agrave; migrer des projet Python 2 vers Python 3. Si vous n&#8217;avez aucun code Python 2 existant, vous pouvez vous passer de cette option.
<li>L&#8217;option <b>Test Suite</b> installe une collection de scripts pour tester l&#8217;interpr&eacute;teur Python lui-m&ecirc;me. Nous n&#8217;allons pas l&#x27;utiliser dans cet ouvrage, je ne l&#8217;ai d&#8217;ailleurs jamais utilis&eacute; dans le cadre d&#8217;aucun cours de programmation avec Python. Consid&eacute;rons le donc comme compl&egrave;tement optionnel.
</ul>

<li>
<p class='ss nm'><img src=i/win-install-3a-disk-usage.png width=499 height=432 alt='[Python installer: disk space requirements]'>
<p>Si vous n&#8217;&ecirc;tes pas s&ucirc;r de combien d&#8217;espace disque vous disposez, cliquez sur le bouton <code>Espace Libre</code>. L&#8217;installeur fera la liste de vos lecteurs, calculera l&#8217;espace disponible sur chacun d&#8217;eux et l&#8217;espace qu&#8217;il resterait sur chacun d&#8217;eux apr&egrave;s l&#8217;installation.
<p>Cliquez sur le bouton <code>OK</code> pour retourner sur la page de &#8220;Personnalisation de votre installation Python&#8221;.

<li>
<p class='ss nm'><img src=i/win-install-3b-test-suite.png width=499 height=432 alt='[Python installer: removing Test Suite option will save 7908KB on your hard drive]'>
<p>Si vous d&eacute;cidez de supprimer une option, il suffit de selectionner le menu d&eacute;roulant associ&eacute; &agrave; l&#8217;option et de s&eacute;lectionner &#8220;La fonctionnalit&eacute; enti&egrave;re sera indisponible.&#8221; Par exemple, exclure les outils de tests vous fera sauver quelques 7908<abbr>KB</abbr> d&#8217;espace disque.
<p>Cliquez sur le bouton <code>Suivant</code> pour valider d&eacute;finitivement vos choix d&#8217;options.

<li>
<p class='ss nm'><img src=i/win-install-4-copying.png width=499 height=432 alt='[Python installer: progress meter]'>
<p>L&#8217;installeur va copier tous les fichiers n&eacute;cessaires dans votre dossier de destination. (C&#8217;est arriv&eacute; si vite chez moi que j&#8217;ai d&ucirc; m&#8217;y reprendre &agrave; trois fois juste pour avoir une copie d&#8217;&eacute;cran correcte !)

<li>
<p class='ss nm'><img src=i/win-install-5-finish.png width=499 height=432 alt='[Python installer: installation completed. Special Windows thanks to Mark Hammond, without whose years of freely shared Windows expertise, Python for Windows would still be Python for DOS.]'>
<p>Cliquez sur le bouton <code>Termin&eacute;</code> pour fermer l&#8217;installeur.

<li>
<p class='ss nm'><img src=i/win-interactive-shell.png width=677 height=715 alt='[Windows Python Shell, a graphical interactive shell for Python]'>
<p>Dans votre menu <code>D&eacute;marrer</code> devrait se trouver maintenant un nouveau menu appel&eacute; <code>Python 3.1</code>. Avec &agrave; l&#8217;int&eacute;rieur, un programme appel&eacute; <abbr>IDLE</abbr>. S&eacute;lectionnez celui-ci pour lancer le shell interactif de Python.

</ol>

<p>[Aller à la partie <a href=#idle>utilisation du shell Python</a>]

<p class=a>&#x2042;

<h2 id=macosx>Installing on Mac OS X</h2>

<p>All modern Macintosh computers use the Intel chip (like most Windows PCs). Older Macs used PowerPC chips. You don&#8217;t need to understand the difference, because there&#8217;s just one Mac Python installer for all Macs.

<p>Visit <a href=http://python.org/download/><code>python.org/download/</code></a> and download the Mac installer. It will be called something like <b>Python 3.1 Mac Installer Disk Image</b>, although the version number may vary. Be sure to download version 3.x, not 2.x.

<ol class=i>

<li>
<p class='ss nm'><img src=i/mac-install-0-dmg-contents.png width=752 height=438 alt='[contents of Python installer disk image]'>
<p>Your browser should automatically mount the disk image and open a Finder window to show you the contents. (If this doesn&#8217;t happen, you&#8217;ll need to find the disk image in your downloads folder and double-click to mount it. It will be named something like <code>python-3.1.dmg</code>.) The disk image contains a number of text files (<code>Build.txt</code>, <code>License.txt</code>, <code>ReadMe.txt</code>), and the actual installer package, <code>Python.mpkg</code>.
<p>Double-click the <code>Python.mpkg</code> installer package to launch the Mac Python installer.

<li>
<p class='ss nm'><img src=i/mac-install-1-welcome.png width=622 height=442 alt='[Python installer: welcome screen]'>
<p>The first page of the installer gives a brief description of Python itself, then refers you to the <code>ReadMe.txt</code> file (which you didn&#8217;t read, did you?) for more details.
<p>Click the <code>Continue</code> button to move along.

<li>
<p class='ss nm'><img src=i/mac-install-2-information.png width=622 height=442 alt='[Python installer: information about supported architectures, disk space, and acceptable destination folders]'>
<p>The next page actually contains some important information: Python requires Mac OS X 10.3 or later. If you are still running Mac OS X 10.2, you should really upgrade. Apple no longer provides security updates for your operating system, and your computer is probably at risk if you ever go online. Also, you can&#8217;t run Python 3.
<p>Click the <code>Continue</code> button to advance.

<li>
<p class='ss nm'><img src=i/mac-install-3-license.png width=622 height=442 alt='[Python installer: software license agreement]'>
<p>Like all good installers, the Python installer displays the software license agreement. Python is open source, and its license is <a href=http://opensource.org/licenses/>approved by the Open Source Initiative</a>. Python has had a number of owners and sponsors throughout its history, each of which has left its mark on the software license. But the end result is this: Python is open source, and you may use it on any platform, for any purpose, without fee or obligation of reciprocity.
<p>Click the <code>Continue</code> button once again.

<li>
<p class='ss nm'><img src=i/mac-install-4-license-dialog.png width=622 height=442 alt='[Python installer: dialog to accept license agreement]'>
<p>Due to quirks in the standard Apple installer framework, you must &#8220;agree&#8221; to the software license in order to complete the installation. Since Python is open source, you are really &#8220;agreeing&#8221; that the license is granting you additional rights, rather than taking them away.
<p>Click the <code>Agree</code> button to continue.

<li>
<p class='ss nm'><img src=i/mac-install-5-standard-install.png width=622 height=442 alt='[Python installer: standard install screen]'>
<p>The next screen allows you to change your install location. You <strong>must</strong> install Python on your boot drive, but due to limitations of the installer, it does not enforce this. In truth, I have never had the need to change the install location.
<p>From this screen, you can also customize the installation to exclude certain features. If you want to do this, click the <code>Customize</code> button; otherwise click the <code>Install</code> button.

<li>
<p class='ss nm'><img src=i/mac-install-6-custom-install.png width=622 height=442 alt='[Python installer: custom install screen]'>
<p>If you choose a Custom Install, the installer will present you with the following list of features:
<ul>
<li><b>Python Framework</b>. This is the guts of Python, and is both selected and disabled because it must be installed.
<li><b>GUI Applications</b> includes IDLE, the graphical Python Shell which you will use throughout this book. I strongly recommend keeping this option selected.
<li><b>UNIX command-line tools</b> includes the command-line <code>python3</code> application. I strongly recommend keeping this option, too.
<li><b>Python Documentation</b> contains much of the information on <a href=http://docs.python.org/><code>docs.python.org</code></a>. Recommended if you are on dialup or have limited Internet access.
<li><b>Shell profile updater</b> controls whether to update your shell profile (used in <code>Terminal.app</code>) to ensure that this version of Python is on the search path of your shell. You probably don&#8217;t need to change this.
<li><b>Fix system Python</b> should not be changed. (It tells your Mac to use Python 3 as the default Python for all scripts, including built-in system scripts from Apple. This would be very bad, since most of those scripts are written for Python 2, and they would fail to run properly under Python 3.)
</ul>
<p>Click the <code>Install</code> button to continue.

<li>
<p class='ss nm'><img src=i/mac-install-7-admin-password.png width=622 height=457 alt='[Python installer: dialog to enter administrative password]'>
<p>Because it installs system-wide frameworks and binaries in <code>/usr/local/bin/</code>, the installer will ask you for an administrative password. There is no way to install Mac Python without administrator privileges.
<p>Click the <code>OK</code> button to begin the installation.

<li>
<p class='ss nm'><img src=i/mac-install-8-progress.png width=622 height=442 alt='[Python installer: progress meter]'>
<p>The installer will display a progress meter while it installs the features you&#8217;ve selected.

<li>
<p class='ss nm'><img src=i/mac-install-9-succeeded.png width=622 height=442 alt='[Python installer: install succeeded]'>
<p>Assuming all went well, the installer will give you a big green checkmark to tell you that the installation completed successfully.
<p>Click the <code>Close</code> button to exit the installer.

<li>
<p class='ss nm'><img src=i/mac-install-10-application-folder.png width=488 height=482 alt='[contents of /Applications/Python 3.1/ folder]'>
<p>Assuming you didn&#8217;t change the install location, you can find the newly installed files in the <code>Python 3.1</code> folder within your <code>/Applications</code> folder. The most important piece is <abbr>IDLE</abbr>, the graphical Python Shell.
<p>Double-click <abbr>IDLE</abbr> to launch the Python Shell.

<li>
<p class='ss nm'><img src=i/mac-interactive-shell.png width=522 height=538 alt='[Mac Python Shell, a graphical interactive shell for Python]'>
<p>The Python Shell is where you will spend most of your time exploring Python. Examples throughout this book will assume that you can find your way into the Python Shell.

</ol>

<p>[Skip to <a href=#idle>using the Python Shell</a>]

<p class=a>&#x2042;

<h2 id=ubuntu>Installing on Ubuntu Linux</h2>

<p>Modern Linux distributions are backed by vast repositories of precompiled applications, ready to install. The exact details vary by distribution. In Ubuntu Linux, the easiest way to install Python 3 is through the <code>Add/Remove</code> application in your <code>Applications</code> menu.

<ol class=i>
<li>
<p class='ss nm'><img src=i/ubu-install-0-add-remove-programs.png width=920 height=473 alt='[Add/Remove: Canonical-maintained applications]'>
<p>When you first launch the <code>Add/Remove</code> application, it will show you a list of preselected applications in different categories. Some are already installed; most are not. Because the repository contains over 10,000 applications, there are different filters you can apply to see small parts of the repository. The default filter is &#8220;Canonical-maintained applications,&#8221; which is a small subset of the total number of applications that are officially supported by Canonical, the company that creates and maintains Ubuntu Linux.

<li>
<p class='ss nm'><img src=i/ubu-install-1-all-open-source-applications.png width=920 height=473 alt='[Add/Remove: all open source applications]'>
<p>Python 3 is not maintained by Canonical, so the first step is to drop down this filter menu and select &#8220;All Open Source applications.&#8221;

<li>
<p class='ss nm'><img src=i/ubu-install-2-search-python-3.png width=920 height=473 alt='[Add/Remove: search for Python 3]'>
<p>Once you&#8217;ve widened the filter to include all open source applications, use the Search box immediately after the filter menu to search for <kbd>Python 3</kbd>.

<li>
<p class='ss nm'><img src=i/ubu-install-3-select-python-3.png width=920 height=473 alt='[Add/Remove: select Python 3.0 package]'>
<p>Now the list of applications narrows to just those matching <kbd>Python 3</kbd>. You&#8217;re going to check two packages. The first is <code>Python (v3.0)</code>. This contains the Python interpreter itself.
<li>
<p class='ss nm'><img src=i/ubu-install-4-select-idle.png width=920 height=473 alt='[Add/Remove: select IDLE for Python 3.0 package]'>
<p>The second package you want is immediately above: <code>IDLE (using Python-3.0)</code>. This is a graphical Python Shell that you will use throughout this book.
<p>After you&#8217;ve checked those two packages, click the <code>Apply Changes</code> button to continue.

<li>
<p class='ss nm'><img src=i/ubu-install-5-apply-changes.png width=635 height=364 alt='[Add/Remove: apply changes]'>
<p>The package manager will ask you to confirm that you want to add both <code>IDLE (using Python-3.0)</code> and <code>Python (v3.0)</code>.
<p>Click the <code>Apply</code> button to continue.

<li>
<p class='ss nm'><img src=i/ubu-install-6-download-progress.png width=287 height=211 alt='[Add/Remove: download progress meter]'>
<p>The package manager will show you a progress meter while it downloads the necessary packages from Canonical&#8217;s Internet repository.

<li>
<p class='ss nm'><img src=i/ubu-install-7-install-progress.png width=486 height=258 alt='[Add/Remove: installation progress meter]'>
<p>Once the packages are downloaded, the package manager will automatically begin installing them.

<li>
<p class='ss nm'><img src=i/ubu-install-8-success.png width=591 height=296 alt='[Add/Remove: new applications have been installed]'>
<p>If all went well, the package manager will confirm that both packages were successfully installed. From here, you can double-click <abbr>IDLE</abbr> to launch the Python Shell, or click the <code>Close</code> button to exit the package manager.
<p>You can always relaunch the Python Shell by going to your <code>Applications</code> menu, then the <code>Programming</code> submenu, and selecting <abbr>IDLE</abbr>.

<li>
<p class='ss nm'><img src=i/ubu-interactive-shell.png width=679 height=687 alt='[Linux Python Shell, a graphical interactive shell for Python]'>
<p>The Python Shell is where you will spend most of your time exploring Python. Examples throughout this book will assume that you can find your way into the Python Shell.

</ol>

<p>[Skip to <a href=#idle>using the Python Shell</a>]

<p class=a>&#x2042;

<h2 id=other>Installing on Other Platforms</h2>

<p>Python 3 is available on a number of different platforms. In particular, it is available in virtually every Linux, <abbr>BSD</abbr>, and Solaris-based distribution. For example, RedHat Linux uses the <code>yum</code> package manager. FreeBSD has its <a href=http://www.freebsd.org/ports/>ports and packages collection</a>, <abbr>SUSE</abbr> has <code>zypper</code>, and Solaris has <code>pkgadd</code>. A quick web search for <code>Python 3</code> + <i>your operating system</i> should tell you whether a Python 3 package is available, and if so, how to install it.

<p class=a>&#x2042;

<h2 id=idle>Using The Python Shell</h2>

<p>The Python Shell is where you can explore Python syntax, get interactive help on commands, and debug short programs. The graphical Python Shell (named <abbr>IDLE</abbr>) also contains a decent text editor that supports Python syntax coloring and integrates with the Python Shell. If you don&#8217;t already have a favorite text editor, you should give <abbr>IDLE</abbr> a try.

<p>First things first. The Python Shell itself is an amazing interactive playground. Throughout this book, you&#8217;ll see examples like this:

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd class=pp>1 + 1</kbd>
<samp class=pp>2</samp></pre>

<p>The three angle brackets, <samp class=p>>>></samp>, denote the Python Shell prompt. Don&#8217;t type that part. That&#8217;s just to let you know that this example is meant to be followed in the Python Shell.

<p><kbd class=pp>1 + 1</kbd> is the part you type. You can type any valid Python expression or command in the Python Shell. Don&#8217;t be shy; it won&#8217;t bite! The worst that will happen is you&#8217;ll get an error message. Commands get executed immediately (once you press <kbd>ENTER</kbd>); expressions get evaluated immediately, and the Python Shell prints out the result.

<p><samp class=pp>2</samp> is the result of evaluating this expression. As it happens, <kbd class=pp>1 + 1</kbd> is a valid Python expression. The result, of course, is <samp class=pp>2</samp>.

<p>Let&#8217;s try another one.

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd class=pp>print('Hello world!')</kbd>
<samp>Hello world!</samp>
</pre>

<p>Pretty simple, no? But there&#8217;s lots more you can do in the Python shell. If you ever get stuck&nbsp;&mdash;&nbsp;you can&#8217;t remember a command, or you can&#8217;t remember the proper arguments to pass a certain function&nbsp;&mdash;&nbsp;you can get interactive help in the Python Shell. Just type <kbd>help</kbd> and press <kbd>ENTER</kbd>.

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd>help</kbd>
<samp>Type help() for interactive help, or help(object) for help about object.</samp></pre>

<p>There are two modes of help. You can get help about a single object, which just prints out the documentation and returns you to the Python Shell prompt. You can also enter <i>help mode</i>, where instead of evaluating Python expressions, you just type keywords or command names and it will print out whatever it knows about that command.

<p>To enter the interactive help mode, type <kbd>help()</kbd> and press <kbd>ENTER</kbd>.

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd class=pp>help()</kbd>
<samp>Welcome to Python 3.0!  This is the online help utility.

If this is your first time using Python, you should definitely check out
the tutorial on the Internet at http://docs.python.org/tutorial/.

Enter the name of any module, keyword, or topic to get help on writing
Python programs and using Python modules.  To quit this help utility and
return to the interpreter, just type "quit".

To get a list of available modules, keywords, or topics, type "modules",
"keywords", or "topics".  Each module also comes with a one-line summary
of what it does; to list the modules whose summaries contain a given word
such as "spam", type "modules spam".
</samp>
<samp class=p>help> </samp></pre>

<p>Note how the prompt changes from <samp class=p>>>></samp> to <samp class=p>help></samp>. This reminds you that you&#8217;re in the interactive help mode. Now you can enter any keyword, command, module name, function name&nbsp;&mdash;&nbsp;pretty much anything Python understands&nbsp;&mdash;&nbsp;and read documentation on it.

<pre class=screen>
<a><samp class=p>help> </samp><kbd class=pp>print</kbd>                                                                 <span class=u>&#x2460;</span></a>
<samp>Help on built-in function print in module builtins:

print(...)
    print(value, ..., sep=' ', end='\n', file=sys.stdout)
    
    Prints the values to a stream, or to sys.stdout by default.
    Optional keyword arguments:
    file: a file-like object (stream); defaults to the current sys.stdout.
    sep:  string inserted between values, default a space.
    end:  string appended after the last value, default a newline.
</samp>
<a><samp class=p>help> </samp><kbd class=pp>PapayaWhip</kbd>                                                            <span class=u>&#x2461;</span></a>
<samp>no Python documentation found for 'PapayaWhip'
</samp>
<a><samp class=p>help> </samp><kbd class=pp>quit</kbd>                                                                  <span class=u>&#x2462;</span></a>
<samp>
You are now leaving help and returning to the Python interpreter.
If you want to ask for help on a particular object directly from the
interpreter, you can type "help(object)".  Executing "help('string')"
has the same effect as typing a particular string at the help> prompt.</samp>
<a><samp class=p>>>> </samp>                                                                        <span class=u>&#x2463;</span></a></pre>
<ol>
<li>To get documentation on the <code>print()</code> function, just type <kbd>print</kbd> and press <kbd>ENTER</kbd>. The interactive help mode will display something akin to a man page: the function name, a brief synopsis, the function&#8217;s arguments and their default values, and so on. If the documentation seems opaque to you, don&#8217;t panic. You&#8217;ll learn more about all these concepts in the next few chapters.
<li>Of course, the interactive help mode doesn&#8217;t know everything. If you type something that isn&#8217;t a Python command, module, function, or other built-in keyword, the interactive help mode will just shrug its virtual shoulders.
<li>To quit the interactive help mode, type <kbd>quit</kbd> and press <kbd>ENTER</kbd>.
<li>The prompt changes back to <samp class=p>>>></samp> to signal that you&#8217;ve left the interactive help mode and returned to the Python Shell.
</ol>

<p><abbr>IDLE</abbr>, the graphical Python Shell, also includes a Python-aware text editor.

<p class=a>&#x2042;

<h2 id=editors>Python Editors and IDEs</h2>

<p><abbr>IDLE</abbr> is not the only game in town when it comes to writing programs in Python. While it&#8217;s useful to get started with learning the language itself, many developers prefer other text editors or Integrated Development Environments (<abbr>IDE</abbr>s). I won&#8217;t cover them here, but the Python community maintains <a href=http://wiki.python.org/moin/PythonEditors>a list of Python-aware editors</a> that covers a wide range of supported platforms and software licenses.

<p>You might also want to check out the <a href=http://wiki.python.org/moin/IntegratedDevelopmentEnvironments>list of Python-aware <abbr>IDE</abbr>s</a>, although few of them support Python 3 yet. One that does is <a href=http://pydev.sourceforge.net/>PyDev</a>, a plugin for <a href=http://eclipse.org/>Eclipse</a> that turns Eclipse into a full-fledged Python <abbr>IDE</abbr>. Both Eclipse and PyDev are cross-platform and open source.

<p>On the commercial front, there is ActiveState&#8217;s <a href=http://www.activestate.com/komodo/>Komodo <abbr>IDE</abbr></a>. It has per-user licensing, but students can get a discount, and a free time-limited trial version is available.

<p>I&#8217;ve been programming in Python for nine years, and I edit my Python programs in <a href=http://www.gnu.org/software/emacs/>GNU Emacs</a> and debug them in the command-line Python Shell. There&#8217;s no right or wrong way to develop in Python. Find a way that works for you!

<p class=v><a href=whats-new.html rel=prev title='back to &#8220;What&#8217;s New In Dive Into Python 3&#8221;'><span class=u>&#x261C;</span></a> <a href=your-first-python-program.html rel=next title='onward to &#8220;Your First Python Program&#8221;'><span class=u>&#x261E;</span></a>

<p class=c>&copy; 2001&ndash;10 <a href=about.html>Mark Pilgrim</a>
<script src=j/jquery.js></script>
<script src=j/prettify.js></script>
<script src=j/dip3.js></script>
