<!DOCTYPE html>
<meta charset=utf-8>
<title>Installation de Python - Plongez au c&oelig;ur de Python 3</title>
<!--[if IE]><script src=j/html5.js></script><![endif]-->
<link rel=stylesheet href=dip3.css>
<style>
body{counter-reset:h1 0}
.i{list-style:none;margin:0;padding:0}
#which{padding-top:1.75em}
h2,.i>li{clear:both}
#divingin,#which{clear:none}
</style>
<link rel=stylesheet media='only screen and (max-device-width: 480px)' href=mobile.css>
<link rel=stylesheet media=print href=print.css>
<meta name=viewport content='initial-scale=1.0'>
<form action=http://www.google.com/cse><div><input type=hidden name=cx value=014021643941856155761:l5eihuescdw><input type=hidden name=ie value=UTF-8>&nbsp;<input type=search name=q size=25 placeholder="powered by Google&trade;">&nbsp;<input type=submit name=sa value=Rechercher></div></form>
<p>Vous &ecirc;tes Ici : <a href=index.html>Accueil</a> <span class=u>&#8227;</span> <a href=table-of-contents.html#installing-python>Plongez au c&oelig;ur de Python 3</a> <span class=u>&#8227;</span>
<p id=level>Niveau de difficult&eacute;e : <span class=u title=novice>&#x2666;&#x2662;&#x2662;&#x2662;&#x2662;</span>
<h1>Installation de Python</h1>
<blockquote class=q>
<p><span class=u>&#x275D;</span> <i lang=la>Tempora mutantur nos et mutamur in illis.</i> (Les temps changent, et nous changeons avec eux.) <span class=u>&#x275E;</span><br>&mdash; vieux proverbe Romain
</blockquote>
<p id=toc>&nbsp;
<h2 id=divingin>Lan&ccedil;ons Nous</h2>
<p class=f>Avant de pouvoir commencer &agrave; programmer avec Python 3, vous devez l&#8217;installer. Ou pas ?

<h2 id=which>Quel Python est votre Python ?</h2>

<p>Si vous utilisez un compte sur un serveur d&#8217;h&eacute;bergement, votre h&eacute;bergeur a peut-&ecirc;tre d&eacute;j&agrave; install&eacute; Python 3. Si vous utilisez Linux &agrave; la maison, you avez peut-&ecirc;tre aussi d&eacute;j&agrave; Python 3. La plupart des distributions GNU/Linux embarquent Python 2 par d&eacute;faut; un petit nombre de distributions incluent Python 3 et cette tendance s&#8217;acc&eacute;l&egrave;re. Mac OS X inclue une version en ligne de commande de Python2, but au moment o&ugrave; ce livre s&#8217;&eacute;crit il n&#8217;inclue pas Python 3. Quant &agrave; Microsoft Windows il n&#8217;inclue aucune version de Python. Mais pas d&#8217;affolement ! Il est toujours possible d&#8217;installer Python en quelques cliques, peu importe le syst&egrave;me d&#8217;exploitation que vous utilisez.

<p>La mani&egrave;re la plus simple pour v&eacute;rifier si Python 3 est sur votre Linux ou votre Mac OS X est <a href=troubleshooting.html#getting-to-the-command-line>d&#8217;acc&eacute;der à la ligne de commande</a>. Une fois que vous avez atteint la ligne de commande de votre syst&egrave;me, tappez juste <kbd>python3</kbd> (tout en minuscule, sans espaces), appuyer sur la touche <kbd>ENTRER</kbd>, et regarder ce qui se passe. Sur mon ordinateur sous Linux, Python 3.1 est d&eacute;j&agrave; install&eacute;, et cette commande m&#8217;envoit dans le <i><dfn>shell interactif</dfn> de Python</i>.

<pre class='nd screen cmdline'>
<samp class=p>mark@atlantis:~$ </samp><kbd>python3</kbd>
<samp>Python 3.1 (r31:73572, Jul 28 2009, 06:52:23) 
[GCC 4.2.4 (Ubuntu 4.2.4-1ubuntu4)] on linux2
Type "help", "copyright", "credits" or "license" for more information.
>>></samp></pre>

<p>(Tappez <kbd>exit()</kbd> et appuyez sur <kbd>ENTRER</kbd> pour sortir du shell interactif de Python.)

<p>Mon <a href=http://cornerhost.com/>h&eacute;bergeur</a> tourne aussi sous Linux et me donne l'acc&egrave;s &agrave; une ligne de commande, mais mon serveur ne poss&egrave;de pas Python 3 d&#8217;install&eacute;. (Sniff!)

<pre class='nd screen cmdline'>
<samp class=p>mark@manganese:~$ </samp><kbd>python3</kbd>
<samp>bash: python3: command not found</samp></pre>

<p>Donc pour en revenir &agrave; la question initiale, &#8220;Quel Python est votre Python ?&#8221;  Celui qui tourne sur l&#8217;ordinateur que vous avez d&eacute;j&agrave;.

<p>[Lisez cette partie pour l&#8217;installation sous Windows, ou passez &agrave; la section <a href=#macosx>Installation sous Mac OS X</a>, <a href=#ubuntu>Installation sous Ubuntu Linux</a>, ou <a href=#other>Installation sous d&#8217;Autres Plateformes</a>.]

<p class=a>&#x2042;

<h2 id=windows>Installation sous Microsoft Windows</h2>

<p>Windows vient sous deux formes d&#8217;architectures ces temps-ci: 32-bit et 64-bit. Bien s&ucirc;r, il y a beaucoup de diff&eacute;rences entre les <i>versions</i> Windows&nbsp;&mdash;&nbsp;XP, Vista, Windows 7&nbsp;&mdash;&nbsp;mais Python tourne indiff&eacute;rement sur toutes ces versions. La plus importante distinction vient de l&#8217;architecture entre 32-bit et 64-bit. Si vous n&#8217;avez aucune id&eacute;e de l&#8217;architecture que vous utilisez, alors c&#8217;est probablement du 32-bit.

<p>Allez sur <a href=http://python.org/download/><code>python.org/download/</code></a> et t&eacute;l&eacute;chargez la version appropri&eacute;e de Python 3  pour votre architecture. Vos choix possibles ressembleront &agrave; quelque chose comme &ccedil;a :

<ul>
<li><b>Python 3.1 Windows installer</b> (Windows binary&nbsp;&mdash;&nbsp;does not include source)
<li><b>Python 3.1 Windows AMD64 installer</b> (Windows AMD64 binary&nbsp;&mdash;&nbsp;does not include source)
</ul>

<p>Je refuse d&#8217;inclure un lien direct sur cette page, car des mise &agrave; jour mineure arrivent tout le temps et je ne veux pas &ecirc; accuser de vous avoir faire manquer une mise &agrave; jour importante. Vous devez toujours installer la plus r&eacute;cente version de Python 3.X sauf si vous poss&egrave;dez une bonne raison esoth&eacute;rique de ne pas le faire.

<ol class=i>
<li>
<p class='ss nm'><img src=i/win-install-0-security-warning.png width=409 height=309 alt='[Windows dialog: open file security warning]'>
<p>Une fois votre t&eacute;l&eacute;chargement termin&eacute;, double-cliquez sur le fichier <code>.msi</code>. Windows va ouvrir une alerte de s&eacute;curit&eacute;, vu que vous &ecirc;tes sur le point d&#8217;ex&eacute;cuter un programme. L&#8217;installeur officiel de Python poss&egrave;de une signature digitale sign&eacute;e par la <a href=http://www.python.org/psf/>Python Software Foundation</a>, l&#8217;organisation &agrave; but non-commerciale qui g&egrave;re le d&eacute;veloppement de Python. Refusez toute imitations !
<p>Cliquez sur le bouton <code>Ex&eacute;cuter</code> pour lan&ccedil;er l&#8217;installation de Python 3.

<li>
<p class='ss nm'><img src=i/win-install-1-all-users-or-just-me.png width=499 height=432 alt='[Python installer: select whether to install Python 3.1 for all users of this computer]'>
<p>La premi&egrave;re question que l&#8217;;installeur va vous poser est si vous souhaitez installer Python 3 pour tous les utilisateurs ou juste pour vous. Le choix par d&eacute;faut propose de &#8220;l&#8217;installer pour tous les utilisateurs,&#8221; ce qui est le meilleur choix sauf si vous avez une bonne raison pour ne pas vouloir. (Une bonne raison pour &#8220;installer juste pour vous&#8221; est si vous installer Python sur l&#8217;ordinateur de votre soci&eacute;t&eacute; et que vous n&#8217;avez pas les droit d&#8217;administrateur sur votre compte Windows. Mais si c&#8217;est vraiment le cas, pourquoi donc installez-vous Python sans la permission de votre administrateur Windows ? A la r&eacute;flexion, je ne veux pas savoir ! Je ne veux pas d&#8217;ennuis !)
<p>Cliquez sur le bouton <code>Suivant</code> pour valider votre type d&#8217;installation.

<li>
<p class='ss nm'><img src=i/win-install-2-destination-directory.png width=499 height=432 alt='[Python installer: select destination directory]'>
<p>Ensuite, l&#8217;installeur va vous demander de choisir une destination o&ugrave; installer Python 3. L&#8217;emplacement par d&eacute;faut de toutes les versions de Python 3.1.x est <code>C:\Python31\</code>, ce qui devrait fonctionner pour la plupart des utilisateurs lambda sauf si une raison sp&eacute;cifique vous demande de changer cet emplacement. Si vous avez d&eacute;finit une partition annexe pour installer certaines applications (e.g. <code>D:</code>), vous pouvez s&eacute;lectionner ce chemin avec les boutons de l&#8217;interface graphique, ou simplement entrer le chemin en toute lettre au clavier. Vous n&#8217;&ecirc;tes donc pas forc&eacute; d&#8217;installer Python sur le lecteur <code>C:</code>; vous pouvez l'installer sur n'importe quel lecteur et dans n'importe quel dossier.
<p>Cliquez sur le bouton <code>Suivant</code> pour valider votre destination d&#8217;installation.

<li>
<p class='ss nm'><img src=i/win-install-3-customize.png width=499 height=432 alt='[Python installer: customize Python 3.1]'>
<p>La page suivante semble compliqu&eacute;e mais ne l&#8217;est pas vraiment. Comme avec beaucoup d&#8217;installeurs, vous avez la possibilit&eacute; de ne pas installer tous les composants de Python 3. Ainsi si votre espace disque disponible est tr&egrave;s faible, vous pouvez exclure de l&#8217;installation certains composants.
<ul>
<li>L&#8217;option <b>Register Extensions</b> vous permet de double-cliquer sur des scripts Python (fichiers <code>.py</code>) pour les ex&eacute;cuter. Elles est recommand&eacute; mais non n&eacute;cessaire. (Cette option ne consomme pas d&#8217;espace disque, il y a donc peu d&#8217;int&eacute;r&ecirc;t &agrave; l&#8217;exclure de l&#8217;installation.)
<li><b>Tcl/Tk</b> est la biblioth&egrave;que graphique utilis&eacute;e par le shell Python, que nous allons utiliser &agrave; travers cet ouvrage. Je recommande tr&egrave;s fortement de conserver cette option.
<li>L&#8217;option <b>Documentation</b> installe des fichiers d&#8217;aide qui contiennent presque autant d&#8217;informations que <a href=http://docs.python.org/><code>docs.python.org</code></a>. Cette option est recommand&eacute; surtout si votre acc&egrave;s &agrave; Internet est limit&eacute;.
<li>L&#8217;option <b>Utility Scripts</b> inclue le tr&egrave;s utile script <code>2to3.py</code> dont nous allons apprendre l&#8217;utilisation <a href=case-study-porting-chardet-to-python-3.html>plus tard dans cet ouvrage</a>. Cette option est n&eacute;cessaire si vous voulez apprendre &agrave; migrer des projet Python 2 vers Python 3. Si vous n&#8217;avez aucun code Python 2 existant, vous pouvez vous passer de cette option.
<li>L&#8217;option <b>Test Suite</b> installe une collection de scripts pour tester l&#8217;interpr&eacute;teur Python lui-m&ecirc;me. Nous n&#8217;allons pas l&#x27;utiliser dans cet ouvrage, je ne l&#8217;ai d&#8217;ailleurs jamais utilis&eacute; dans le cadre d&#8217;aucun cours de programmation avec Python. Consid&eacute;rons le donc comme compl&egrave;tement optionnel.
</ul>

<li>
<p class='ss nm'><img src=i/win-install-3a-disk-usage.png width=499 height=432 alt='[Python installer: disk space requirements]'>
<p>Si vous n&#8217;&ecirc;tes pas s&ucirc;r de combien d&#8217;espace disque vous disposez, cliquez sur le bouton <code>Espace Libre</code>. L&#8217;installeur fera la liste de vos lecteurs, calculera l&#8217;espace disponible sur chacun d&#8217;eux et l&#8217;espace qu&#8217;il resterait sur chacun d&#8217;eux apr&egrave;s l&#8217;installation.
<p>Cliquez sur le bouton <code>OK</code> pour retourner sur la page de &#8220;Personnalisation de votre installation Python&#8221;.

<li>
<p class='ss nm'><img src=i/win-install-3b-test-suite.png width=499 height=432 alt='[Python installer: removing Test Suite option will save 7908KB on your hard drive]'>
<p>Si vous d&eacute;cidez de supprimer une option, il suffit de selectionner le menu d&eacute;roulant associ&eacute; &agrave; l&#8217;option et de s&eacute;lectionner &#8220;La fonctionnalit&eacute; enti&egrave;re sera indisponible.&#8221; Par exemple, exclure les outils de tests vous fera sauver quelques 7908<abbr>KB</abbr> d&#8217;espace disque.
<p>Cliquez sur le bouton <code>Suivant</code> pour valider d&eacute;finitivement vos choix d&#8217;options.

<li>
<p class='ss nm'><img src=i/win-install-4-copying.png width=499 height=432 alt='[Python installer: progress meter]'>
<p>L&#8217;installeur va copier tous les fichiers n&eacute;cessaires dans votre dossier de destination. (C&#8217;est arriv&eacute; si vite chez moi que j&#8217;ai d&ucirc; m&#8217;y reprendre &agrave; trois fois juste pour avoir une copie d&#8217;&eacute;cran correcte !)

<li>
<p class='ss nm'><img src=i/win-install-5-finish.png width=499 height=432 alt='[Python installer: installation completed. Special Windows thanks to Mark Hammond, without whose years of freely shared Windows expertise, Python for Windows would still be Python for DOS.]'>
<p>Cliquez sur le bouton <code>Termin&eacute;</code> pour fermer l&#8217;installeur.

<li>
<p class='ss nm'><img src=i/win-interactive-shell.png width=677 height=715 alt='[Windows Python Shell, a graphical interactive shell for Python]'>
<p>Dans votre menu <code>D&eacute;marrer</code> devrait se trouver maintenant un nouveau menu appel&eacute; <code>Python 3.1</code>. Avec &agrave; l&#8217;int&eacute;rieur, un programme appel&eacute; <abbr>IDLE</abbr>. S&eacute;lectionnez celui-ci pour lancer le shell interactif de Python.

</ol>

<p>[Aller &agrave; la partie <a href=#idle>utilisation du shell Python</a>]

<p class=a>&#x2042;

<h2 id=macosx>Installation sous Mac OS X</h2>

<p>Tous les ordinateurs Macintosh modernes utilisent un processeur Intel (comme la plupart des PC Windows). Les anciens Macs utilisent des processeurs PowerPC. Vous n&#8217;avez m&ecirc;me pas besoin de conna&icirc;tre la diff&eacute;rence, car il n&#8217;y a qu&#8217;un seul installeur Mac pour Python et ce pour tous les Macs.

<p>Aller sur le site <a href=http://python.org/download/><code>python.org/download/</code></a> et t&eacute;l&eacute;charger l&#8217;installeur Python pour Mac. Il sera appel&eacute; quelque chose comme <b>Python 3.1 Mac Installer Disk Image</b>, m&ecirc;me si le num&eacute;ro de version peut varier. Soyez juste s&ucirc;r de t&eacute;l&eacute;charger une version 3.x, et pas 2.x.

<ol class=i>

<li>
<p class='ss nm'><img src=i/mac-install-0-dmg-contents.png width=752 height=438 alt='[contents of Python installer disk image]'>
<p>Votre navigateur internet devrait monter automatiquement l&#8217;image disque et ouvrir une fen&ecirc;tre Finder pour vous en montrer le contenu. (Si cela n&#8217;arrive pas, il vous faudra aller chercher dans votre dossier de t&eacute;l&eacute;chargement et double-cliquer sur l&#8217;image dmg pour la monter. Elle sera nomm&eacute; quelque chose comme <code>python-3.1.dmg</code>.) L&#8217;image disque contient un certain nombre de fichiers texte  (<code>Build.txt</code>, <code>License.txt</code>, <code>ReadMe.txt</code>), et notre objectif l&#8217;installeur, <code>Python.mpkg</code>.
<p>Double-cliquez sur l&#8217;installeur <code>Python.mpkg</code> pour lancer l&#8217;installation de Python pour Mac.

<li>
<p class='ss nm'><img src=i/mac-install-1-welcome.png width=622 height=442 alt='[Python installer: welcome screen]'>
<p>La premi&egrave;re page de cet installeur vous donne une bref description de Python en lui-m&ecirc;me, puis vous renvoie au fichier  <code>ReadMe.txt</code> (que vous n&#8217;avez pas lu, hein ?) pour plus de d&eacute;tails.
<p>Cliquez sur le bouton <code>Continuer</code> pour la suite.

<li>
<p class='ss nm'><img src=i/mac-install-2-information.png width=622 height=442 alt='[Python installer: information about supported architectures, disk space, and acceptable destination folders]'>
<p>La page suivante contient en revanche quelques informations importantes : Python n&eacute;cessite Mac OS X 10.3 ou sup&eacute;rieure. Si vous utilisez toujours Mac OS X 10.2, vous devriez vraiment mettre votre syst&egrave;me &agrave; jour. Apple ne fournit d&#8217;ailleurs plus de mises &agrave; jour de s&eacute;curit&eacute; pour votre syst&egrave;me d&#8217;exploitation, ainsi il est risqu&eacute; d&#8217;utiliser votre ordinateur pour aller sur Internet. En plus vous ne pourrez pas ex&eacute;cuter Python 3.
<p>Cliquez sur le bouton <code>Continuer</code> pour avancer.

<li>
<p class='ss nm'><img src=i/mac-install-3-license.png width=622 height=442 alt='[Python installer: software license agreement]'>
<p>Comme tout bon installeur, celui de Python vous demande d&#8217;accepter la licence d&#8217;utilisation. Seulement Python est libre et open source, et la licence qu&#8217;il utilise <a href=http://opensource.org/licenses/> est valid&eacute;e par l&#8217;OSI ( Open Source Initiative )</a>. Python a eu dans son histoire un certain nombre de propri&eacute;taires et de sponsors, chacun ayant laiss&eacute; son empreinte sur la licence du logiciel. Mais la conclusion de cette histoire est simple : Python est libre et open source, et vous pouvez l&#8217;utiliser sur n&#8217;importe quelle plateformes, pour n&#8217;importe quel motif, et sans frais ni obligations.
<p>Cliquez sur le bouton <code>Continuer</code> encore une fois.

<li>
<p class='ss nm'><img src=i/mac-install-4-license-dialog.png width=622 height=442 alt='[Python installer: dialog to accept license agreement]'>
<p>&Agrave; cause du processus d&#8217;installation standard d&#8217;Apple, vous devez &#8220;accepter&#8221; la licence du logiciel pour pouvoir terminer l&#8217;installation. Mais &eacute;tant donn&eacute; que Python est open source, vous n&#8217;&ecirc;tes jamais qu&#8217;en train de confirmer que la licence vous donne tout les droits pr&eacute;c&eacute;demment &eacute;voqu&eacute;s, plut&ocirc;t que de vous les enlever.
<p>Cliquez sur le bouton <code>Accepter</code> pour continuer.

<li>
<p class='ss nm'><img src=i/mac-install-5-standard-install.png width=622 height=442 alt='[Python installer: standard install screen]'>
<p>L&#8217;écran suivant vous permet de changer la destination d&#8217;installation. Vous <strong>devez</strong> installer Python sur votre disque de démarrage, mais due aux limitations de l&#8217;installeur, cela ne sera pas vérifié automatiquement. Pour être honnête, je n'ai jamais eu à changer la destination de l'installation.
<p>Depuis cet écran, vous pouvez aussi personnaliser votre installation pour exclure certaines fonctionnalités. Si vous souhaitez faire cela, cliquez sur le bouton <code>Personnaliser</code>; sinon cliquez sur le bouton <code>Installer</code>.

<li>
<p class='ss nm'><img src=i/mac-install-6-custom-install.png width=622 height=442 alt='[Python installer: custom install screen]'>
<p>Si vous choisissez de personnaliser votre Installation, l&#8217;installeur va vous présenter la liste suivante de fonctionnalités :
<ul>
<li><b>Python Framework</b>. Ce sont les tripes de Python, c&#8217;est pourquoi cette option est &agrave; la fois s&eacute;lectionn&eacute;e et d&eacute;sactiv&eacute;e, elle doit &ecirc;tre install&eacute;e.
<li>L&#8217;option <b>GUI Applications</b> inclue IDLE, le shell graphique de Python que l&#8217;on va utiliser &agrave; travers ce livre. Je recommande vivement de conserver cette fonctionnalit&eacute;.
<li>L&#8217;option <b>UNIX command-line tools</b> ajoute dans la ligne de commande l&#8217;application <code>python3</code>. Je recommande aussi vivement de garder cette option.
<li>La <b>Python Documentation</b> contient la plupart des information du site <a href=http://docs.python.org/><code>docs.python.org</code></a>. Je recommande de conserver cette option si vous avez un acc&egrave;s limit&eacute; &agrave; Internet.
<li>L&#8217;option <b>Shell profile updater</b> permet de contr&ocirc;ler si vous voulez mettre &agrave; jour votre profile (utilis&eacute; dans  <code>Terminal.app</code>) pour &ecirc;tre s&ucirc;r que cette version de Python est dans le path de votre shell. Vous n&#8217;avez tr&egrave;s probablement pas besoin de modifier cette option.
<li>L&#8217;option <b>Fix system Python</b> ne devrait pas &ecirc;tre modifi&eacute;e. (Cette option dit &agrave; votre Mac d&#8217;utiliser Python 3 en tant que Python par d&eacute;faut pour tous les scripts, m&ecirc;me pour ceux cr&eacute;er par Apple et incluent de base dans votre syst&egrave;me. C&#8217;est une chose &agrave; &eacute;viter absoluement, car beaucoup de ces scripts ont &eacute;t&eacute; &eacute;crit pour Python 2, et ne r&eacute;ussirait donc pas &agrave; s&#8217;ex&eacute;cuter correctement sous Python 3.)
</ul>
<p>Cliquez sur le bouton <code>Installer</code> pour continuer.

<li>
<p class='ss nm'><img src=i/mac-install-7-admin-password.png width=622 height=457 alt='[Python installer: dialog to enter administrative password]'>
<p>L&#x27;installation de Python &agrave; l&#x27;&eacute;chelle du syst&egrave;me s&#x27;effectuant en partie dans <code>/usr/local/bin/</code>, l&#x27;installeur vous demandera les droits administrateurs pour commencer l&#x27;installation. Il n&#x27;y a donc aucun moyen d&#x27;installation Python sous Mac sans droits administrateurs.
<p>Cliquez sur le bouton <code>OK</code> pour commencer l&#x27;installation.

<li>
<p class='ss nm'><img src=i/mac-install-8-progress.png width=622 height=442 alt='[Python installer: progress meter]'>
<p>L&#x27;installeur vous affichera une barre de progression pendant l&#x27;installation des fonctionnalit&eacute;s s&eacute;lectionn&eacute;e.

<li>
<p class='ss nm'><img src=i/mac-install-9-succeeded.png width=622 height=442 alt='[Python installer: install succeeded]'>
<p>En admettant que tout s&#x27;est bien pass&eacute;, l&#x27;installeur vous affichera une belle grosse ic&ocirc;ne verte pour vous confirmer que l&#x27;installation s&#x27;est bien pass&eacute;e.
<p>CLiquez sur le bouton <code>Termin&eacute;</code> pour sortir de l&#x27;installeur.

<li>
<p class='ss nm'><img src=i/mac-install-10-application-folder.png width=488 height=482 alt='[contents of /Applications/Python 3.1/ folder]'>
<p>En admettant que vous n&#x27;ayez pas changer le r&eacute;pertoire par d&eacute;faut d&#x27;installation, vous pouvez trouver votre nouvelle installation de  <code>Python 3.1</code> dans votre dossier <code>/Applications</code>. La plus importante partie de cette installation est <abbr>IDLE</abbr>, le shell graphique interactif de Python.
<p>Double-cliquez sur <abbr>IDLE</abbr> pour lancer le shell Python.

<li>
<p class='ss nm'><img src=i/mac-interactive-shell.png width=522 height=538 alt='[Mac Python Shell, a graphical interactive shell for Python]'>
<p>Le shell Python est l&#x27;endroit o&ugrave; vous passerez le plus clair de votre temps d&#x27;exploration de Python. Les exemples de cet ouvrage partiront d&#x27;ailleurs du principe que vous pouvez vous y retrouver dans le shell Python, donc autant s&#x27;entra&icirc;ner !

</ol>

<p>[Aller &agrave; la partie <a href=#idle>utilisation du shell Python</a>]

<p class=a>&#x2042;

<h2 id=ubuntu>Installation sous Ubuntu Linux</h2>

<p>Les distributions modernes de Linux poss&egrave;dent tous de larges d&eacute;p&ocirc;t d&#x27;applications pr&eacute;compil&eacute;es, pr&ecirc;tes &agrave; &ecirc;tre install&eacute;es. Les d&eacute;tails d&#x27;impl&eacute;mentation varient cependant selon les distributions. Sous Ubuntu Linux, la fa&ccedil;on la plus simple d&#x27;installer Python 3 est d&#x27;utiliser l&#x27;outil   <code>Ajouter/Supprimer</code> de votre menu <code>Applications</code>.

<ol class=i>
<li>
<p class='ss nm'><img src=i/ubu-install-0-add-remove-programs.png width=920 height=473 alt='[Add/Remove: Canonical-maintained applications]'>
<p>Quand vous lancez pour la premi&egrave;re fois l&#x27;outil <code>Ajouter/Supprimer</code>, il vous montre une liste d&#x27;applications pr&eacute;-s&eacute;lectionn&eacute;e dans diff&eacute;rentes cat&eacute;gories. Certaines sont d&eacute;j&agrave; install&eacute;es; la plupart ne le sont pas. Comme les d&eacute;p&ocirc;ts contiennent plus de 10 000 applications, il y a diff&eacute;rents filtres que vous pouvez appliquer pour voir seulement des parties des d&eacute;p&ocirc;ts. Le filtre par d&eacute;faut inclue les &#8220;applications maintenues par Canonical,&#8221; ce qui correspond &agrave; un ensemble relativement restreint des applications officiellement support&eacute;e par Canonical, la soci&eacute;t&eacute; qui a cr&eacute;&eacute; et maintient Linux.

<li>
<p class='ss nm'><img src=i/ubu-install-1-all-open-source-applications.png width=920 height=473 alt='[Add/Remove: all open source applications]'>
<p>Python 3 n&#x27;est pas maintenu par Canonical, donc la premi&egrave;re &eacute;tape est de changer le filtre par d&eacute;faut pour s&eacute;lectionner le filtre  &#8220;Toutes applications Open Source.&#8221;

<li>
<p class='ss nm'><img src=i/ubu-install-2-search-python-3.png width=920 height=473 alt='[Add/Remove: search for Python 3]'>
<p>Une fois votre filtre &eacute;largit pour inclure toutes applications open source, utilisez le champ de Recherche juste apr&egrave;s le menu Filtre pour chercher <kbd>Python 3</kbd>.

<li>
<p class='ss nm'><img src=i/ubu-install-3-select-python-3.png width=920 height=473 alt='[Add/Remove: select Python 3.0 package]'>
<p>Ainsi la liste des applications se r&eacute;duit &agrave; ceux dont les crit&egrave;res correspondent au mots cl&eacute;s <kbd>Python 3</kbd>. Nous allons donc r&eacute;cup&eacute;rer deux paquets. Le premier est <code>Python (v3.0)</code>. Il contient l&#x27;interpr&eacute;teur Python en lui-m&ecirc;me.
<li>
<p class='ss nm'><img src=i/ubu-install-4-select-idle.png width=920 height=473 alt='[Add/Remove: select IDLE for Python 3.0 package]'>
<p>Le second paquet que nous allons choisir est directement au dessus : <code>IDLE (avec Python-3.0)</code>. C&#x27;est le shell interactif Python que nous allons tout le temps utiliser &agrave; travers cet ouvrage.
<p>Apr&egrave;s avoir s&eacute;lectionn&eacute; ces deux paquets, cliquez sous le bouton <code>Appliquez les Changements</code> pour continuer.

<li>
<p class='ss nm'><img src=i/ubu-install-5-apply-changes.png width=635 height=364 alt='[Add/Remove: apply changes]'>
<p>Le gestionnaire de paquets va vous demander de confirmer votre choix d&#x27;installer &agrave; la fois <code>IDLE (avec Python-3.0)</code> et <code>Python (v3.0)</code>.
<p>Cliquez sur le bouton <code>Appliquer</code> pour continuer.

<li>
<p class='ss nm'><img src=i/ubu-install-6-download-progress.png width=287 height=211 alt='[Add/Remove: download progress meter]'>
<p>Le gestionnaire de paquets va afficher une barre de progression pendant qu&#x27;il t&eacute;l&eacute;charge les donn&eacute;es n&eacute;cessaire depuis les d&eacute;p&ocirc;ts Internet de Canonical.

<li>
<p class='ss nm'><img src=i/ubu-install-7-install-progress.png width=486 height=258 alt='[Add/Remove: installation progress meter]'>
<p>Une fois les donn&eacute;es t&eacute;l&eacute;charg&eacute;es, le gestionnaire de paquets va automatiquement commencer l&#x27;installation.

<li>
<p class='ss nm'><img src=i/ubu-install-8-success.png width=591 height=296 alt='[Add/Remove: new applications have been installed]'>
<p>Si tout se passe bien, le gestionnaire de paquets va confirmer que l&#x27;installation a &eacute;t&eacute; un succ&egrave;s. A partir de l&agrave;, vous pouvez double-cliquer sur l&#x27;application <abbr>IDLE</abbr> pour lancer le shell Python, ou cliquer sur le bouton <code>Termin&eacute;</code> du gestionnaire de paquets.
<p>Vous pouvez toujours relancer le shell Python en allant dans le menu <code>Applications</code>, puis dans la sous-menu  <code>Programmation</code>, et s&eacute;lectionner <abbr>IDLE</abbr>.

<li>
<p class='ss nm'><img src=i/ubu-interactive-shell.png width=679 height=687 alt='[Linux Python Shell, a graphical interactive shell for Python]'>
<p>Le shell Python est l&#x27;endroit o&ugrave; vous passerez le plus clair de votre temps d&#x27;exploration de Python. Les exemples de cet ouvrage partiront d&#x27;ailleurs du principe que vous pouvez vous y retrouver dans le shell Python, donc autant s&#x27;entra&icirc;ner !

</ol>

<p>[Aller &agrave; la partie <a href=#idle>utilisation du shell Python</a>]

<p class=a>&#x2042;

<h2 id=other>Installation sous d&#8217;Autres Plateformes</h2>

<p>Python 3 est disponible sur un certain nombre de plateformes. En particulier, il est disponible sur virtuellement toutes les distributions bas&eacute;es sur Linux, <abbr>BSD</abbr>, ou Solaris. Par exemple, RedHat Linux utilise le gestionnaire de paquet <code>yum</code>. FreeBSD a <a href=http://www.freebsd.org/ports/>une collection de paquets disponibles</a>, <abbr>SUSE</abbr> a <code>zypper</code>, et  Solaris <code>pkgadd</code>. Une recherche rapide sur Internet avec comme mots cl&eacute;s <code>Python 3</code> + <i>votre syst&egrave;me d&#x27;exploitation</i> devrait vous dire si un quelconque paquet de Python 3 est disponible, et si oui, comment l&#x27;installer.

<p class=a>&#x2042;

<h2 id=idle>Utilisation du shell Python</h2>

<p>Le shell Python est l&#x27;endroit o&ugrave; l&#x27;on peut explorer la syntaxe de Python, avoir de l&#x27;aide de mani&egrave;re interactive sur des commandes, et d&eacute;bogguer des petits programmes. Le shelle graphique de Python (appell&eacute; <abbr>IDLE</abbr>) contient en plus un &eacute;diteur de texte d&eacute;&ccedil;ent qui supporte une coloration syntaxique du code Python et s&#x27;int&egrave;gre bien avec le shell Python. Ainsi si vous n&#x27;avez pas d&eacute;j&agrave; un &eacute;diteur de texte f&eacute;tiche, vous pouvez toujours essayer <abbr>IDLE</abbr>.

<p>Commen&ccedil;ons par le commencement. Le shell Python en lui-m&ecirc;me est un superbe terrain de jeu interactif. &Agrave; travers cet ouvrage, vous allez voir des exemples de ce type :

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd class=pp>1 + 1</kbd>
<samp class=pp>2</samp></pre>

<p>Les trois symboles sup&eacute;rieurs, <samp class=p>&gt;&gt;&gt;</samp>, symbolisent le shell Python. Ne tapez jamais cette partie. C&#x27;est juste pour vous faire comprendre que cet exemple doit &ecirc;tre ex&eacute;cut&eacute; depuis le shell Python.

<p><kbd class=pp>1 + 1</kbd> est donc la partie que l&#x27;on tape dans le shell. Vous pouvez taper n&#x27;importe quelle valide expression Python ou commande dans le shell Python. Ne soyez pas timide, il ne mords pas ! Le pire qui puisse arriver est d&#x27;obtenir un message d&#x27;erreur. Les commandes sont par ailleurs ex&eacute;cut&eacute;es imm&eacute;diatement (une fois la touche <kbd>ENTR&Eacute;E</kbd> press&eacute;e); et les expressions sont &eacute;valu&eacute;es imm&eacute;diatement, et le shell Python affiche le r&eacute;sultat &agrave; l&#x27;&eacute;cran.

<p><samp class=pp>2</samp> est le r&eacute;sultat de l&#x27;&eacute;valuation de cette expression. Comme il est clair que, <kbd class=pp>1 + 1</kbd> est une expression Python valide. Le r&eacute;sultat, bien s&ucirc;r, est <samp class=pp>2</samp>.

<p>Essayons autre chose.

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd class=pp>print('Hello world!')</kbd>
<samp>Hello world!</samp>
</pre>

<p>C&#x27;est assez simple, non ? Mais il y a plus &agrave; faire dans le shell Python que cela. Si &agrave; un moment vous &ecirc;tes bloqu&eacute;&nbsp;&mdash;&nbsp;vous n&#x27;arrivez pas &agrave; vous souvenir d&#x27;une commande, ou vous n&#x27;arrivez plus &agrave; remettre la main sur les arguments &agrave; passer &agrave; une certaine fonction&nbsp;&mdash;&nbsp;vous pouvez toujours obtenir de l&#x27;aide de mani&egrave;re interactive avec le shell de Python. Tapez juste <kbd>help</kbd> et appuyez sur <kbd>ENTR&Eacute;E</kbd>.

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd>help</kbd>
<samp>Type help() for interactive help, or help(object) for help about object.</samp></pre>

<p>Il y a deux modes d&#x27;aide. Vous pouvez obtenir de l&#x27;aide &agrave; propos d&#x27;un seul objet, ce qui va juste vous afficher la documentation et vous rendre imm&eacute;diatement la main. Vous pouvez aussi rentrer dans <i>le mode d&#x27;aide</i>, o&ugrave; au lieu d&#x27;&eacute;valuer des expressions Python, vous tapez des mot cl&eacute;s ou des noms de commandes et le shell affichera &agrave; l&#x27;&eacute;cran tout ce qu&#x27;il sait sur cette commande.

<p>Pour entrer dans ce mode interactif, tapez <kbd>help()</kbd> et appuyez sur <kbd>ENTR&Eacute;E</kbd>.

<pre class='nd screen'>
<samp class=p>>>> </samp><kbd class=pp>help()</kbd>
<samp>Welcome to Python 3.0!  This is the online help utility.

If this is your first time using Python, you should definitely check out
the tutorial on the Internet at http://docs.python.org/tutorial/.

Enter the name of any module, keyword, or topic to get help on writing
Python programs and using Python modules.  To quit this help utility and
return to the interpreter, just type "quit".

To get a list of available modules, keywords, or topics, type "modules",
"keywords", or "topics".  Each module also comes with a one-line summary
of what it does; to list the modules whose summaries contain a given word
such as "spam", type "modules spam".
</samp>
<samp class=p>help> </samp></pre>

<p>On peut d&#x27;ailleurs voir que l&#x27;invite de commande change de forme passant de <samp class=p>>>></samp> &agrave; <samp class=p>help></samp>. Cela permet de bien vous rappeller que vous &ecirc;tes dans le mode d&#x27;aide interactive de Python et pas dans l&#x27;invite de commande normal. Maintenant vous pouvez entrer n&#x27;importe quel mot cl&eacute;, commande, nom de module, nom de fonction&nbsp;&mdash;&nbsp;en fait tout ce que Python peut arriver &agrave; comprendre&nbsp;&mdash;&nbsp;et obtenir directement la documentation associ&eacute;e.

<pre class=screen>
<a><samp class=p>help> </samp><kbd class=pp>print</kbd>                                                                 <span class=u>&#x2460;</span></a>
<samp>Help on built-in function print in module builtins:

print(...)
    print(value, ..., sep=' ', end='\n', file=sys.stdout)
    
    Prints the values to a stream, or to sys.stdout by default.
    Optional keyword arguments:
    file: a file-like object (stream); defaults to the current sys.stdout.
    sep:  string inserted between values, default a space.
    end:  string appended after the last value, default a newline.
</samp>
<a><samp class=p>help> </samp><kbd class=pp>PapayaWhip</kbd>                                                            <span class=u>&#x2461;</span></a>
<samp>no Python documentation found for 'PapayaWhip'
</samp>
<a><samp class=p>help> </samp><kbd class=pp>quit</kbd>                                                                  <span class=u>&#x2462;</span></a>
<samp>
You are now leaving help and returning to the Python interpreter.
If you want to ask for help on a particular object directly from the
interpreter, you can type "help(object)".  Executing "help('string')"
has the same effect as typing a particular string at the help> prompt.</samp>
<a><samp class=p>>>> </samp>                                                                        <span class=u>&#x2463;</span></a></pre>
<ol>
<li>Pour obtenir la documentation sur la fonction <code>print()</code>, il vous suffit de taper <kbd>print</kbd> et d&#x27;appuyer sur <kbd>ENTR&Eacute;E</kbd>. Le mode d&#x27;aide interactif va alors afficher une page d&#x27;aide ressemblant tr&egrave;s fortement &agrave; une page man sous Linux avec : le nom de la fonction, un l&eacute;ger r&eacute;sum&eacute; de ses fonctionnalit&eacute;s, les arguments d&#x27;entr&eacute;e de la fonction ainsi que leurs valeurs par d&eacute;fauts, et ainsi de suite. Si la documentation semble l&eacute;g&egrave;rement abstraite pour vous, ne paniquez pas. Vous apprenderez plus sur les concepts de base de Python dans les prochains chapitres.
<li>Bien s&ucirc;r , le mode d&#x27;aide interactif ne sait pas tout. Si vous tapez quelque chose qui n&#x27;est pas une commande Python, un module, une function, or tout autre mot cl&eacute; du c&oelig;ur de Python, le mode d&#x27;aide interactive va juste s&#x27;avouer vaincu et dire qu&#x27;il ne peut rien pour vous.
<li>Pour quitter le mode d&#x27;aide interactif , il suffit de taper <kbd>quit</kbd> et d&#x27;appuyer sur la touche <kbd>ENTR&Eacute;E</kbd>.
<li>L&#x27;invite de commande reviendra &agrave; son &eacute;tat normal <samp class=p>>>></samp> pour vous confirmer que vous avez quitter le mode d&#x27;aide interactif et que vous &ecirc;tes maintenant de retour dans le shell Python.
</ol>

<p><abbr>IDLE</abbr>, le shell graphique de Python, inclue aussi un &eacute;diteur de texte adapt&eacute; &agrave; Python.

<p class=a>&#x2042;

<h2 id=editors>Les &eacute;diteurs Python et IDEs</h2>

<p><abbr>IDLE</abbr> n&#x27;est pas le seul logiciel utilisable quand il s&#x27;agit d'&eacute;crire des programmes en Python. Car si c&#x27;est un bon &eacute;diteur quand il s&#x27;agit d&#x27;apprendre sur le langage Python en lui-m&ecirc;me, de nombreux d&eacute;veloppeurs pr&eacute;f&egrave;rent utiliser d&#x27;autres &eacute;diteurs de texte ou d&#x27;autres Environnements de D&eacute;veloppement Int&eacute;gr&eacute;s (des <abbr>IDE</abbr> (Integrated Development Environments)). Je ne vais pas couvrir ce sujet ici, mais la communaut&eacute; Python maintient <a href=http://wiki.python.org/moin/PythonEditors>une liste des &eacute;diteurs de textes utilisables avec Python</a> qui permet de trouver son bonheur &agrave; la fois en terme de plateforme et en terme de licenses logicelles.

<p>Vous voudrez aussi probablement regarder la <a href=http://wiki.python.org/moin/IntegratedDevelopmentEnvironments>liste des <abbr>IDE</abbr>s adapt&eacute;s &agrave; Python</a>, m&ecirc;me si tr&egrave;s peu d&#x27;entre eux &agrave; l&#x27;heure actuelle supportent Python 3. Par exemple <a href=http://pydev.sourceforge.net/>PyDev</a>, qui est un plugin pour <a href=http://eclipse.org/>Eclipse</a> et qui transforme Eclipse en un tr&egrave;s bon <abbr>IDE</abbr> pour Python, supporte maintenant Python 3. En plus &agrave; la fois Eclipse et PyDev sont multi-platformes et open source.

<p>Du cot&eacute; commerciale, il y a l&#x27;<abbr>IDE</abbr> <a href=http://www.activestate.com/komodo/>Komodo</a> d&#x27;ActiveState. Sa license est disponible par utilisateur, mais les &eacute;tudiants peuvent obtenir un tarif r&eacute;duit, et une version gratuite limit&eacute;e dans le temps est disponible.

<p>Je programme en Python depuis maintenant neuf ans, et je cr&eacute;&eacute; mes programmes Python principalement avec <a href=http://www.gnu.org/software/emacs/>GNU Emacs</a> en d&eacute;boggant avec le shell Python. Il y a pas de bonne ou de mauvaise fa&ccedil;on de d&eacute;velopper en Python. Trouvez celui qui vous convient !

<p class=v><a href=whats-new.html rel=prev title='retour &agrave; &#8220;Quoi de neuf dans Plongez au c&oelig;ur de Python 3&#8221;'><span class=u>&#x261C;</span></a> <a href=your-first-python-program.html rel=next title='vers &#8220;Votre premier programme en Python&#8221;'><span class=u>&#x261E;</span></a>

<p class=c>&copy; 2001&ndash;10 <a href=about.html>Mark Pilgrim</a>
<script src=j/jquery.js></script>
<script src=j/prettify.js></script>
<script src=j/dip3.js></script>
