<!DOCTYPE html>
<meta charset=utf-8>
<title>Quoi de neuf dans Plongez au c&oelig;ur de Python 3</title>
<!--[if IE]><script src=j/html5.js></script><![endif]-->
<link rel=stylesheet href=dip3.css>
<style>
body{counter-reset:h1 -1}
h3:before{content:''}
</style>
<link rel=stylesheet media='only screen and (max-device-width: 480px)' href=mobile.css>
<link rel=stylesheet media=print href=print.css>
<meta name=viewport content='initial-scale=1.0'>
<form action=http://www.google.com/cse><div><input type=hidden name=cx value=014021643941856155761:l5eihuescdw><input type=hidden name=ie value=UTF-8>&nbsp;<input type=search name=q size=25 placeholder="powered by Google&trade;">&nbsp;<input type=submit name=sa value=Rechercher></div></form>
<p>Vous &ecirc;tes Ici : <a href=index.html>Accueil</a> <span class=u>&#8227;</span> <a href=table-of-contents.html#whats-new>Plongez au c&oelig;ur de Python 3</a> <span class=u>&#8227;</span>
<h1>Quoi de neuf dans &#8220;Plongez au c&oelig;ur de Python 3&#8221;</h1>
<blockquote class=q>
<p><span class=u>&#x275D;</span> Isn&#8217;t this where we came in? <span class=u>&#x275E;</span><br>&mdash; Pink Floyd, The Wall
</blockquote>
<p id=toc>&nbsp;
<h2 id=divingin><i>alias</i> &#8220;le niveau -1&#8221;</h2>

<p class=f>&Ecirc;tes-vous d&eacute;j&agrave; un d&eacute;veloppeur Python ? Avez-vous lu le premier ouvrage &#8220;<a href=http://diveintopython.org/>Plongez au c&oelig;ur de Python</a>&#8221;? L&#8217;avez-vous achet&eacute; ? (si oui, merci !) &Ecirc;tes-vous pr&ecirc;t &agrave; sauter le pas vers Python 3 ? Si oui, continuez &agrave; lire. (si aucune de ces assertions n&#8217;est v&eacute;rifi&eacute;es, vous devriez <a href=installing-python.html>commencer par le commencement</a>).

<p>Python 3  est fourni avec un script appel&eacute; <code>2to3</code>. Apprenez &agrave; l&#8217;utiliser et (pourquoi pas) &agrave; l&#8217;aimer. Pour cela <a href=porting-code-to-python-3-with-2to3.html>Porter du Code &agrave; Python 3 avec <code>2to3</code></a> est la page de r&eacute;f&eacute;rence pour tous les probl&egrave;mes que <code>2to3</code> peut automatiquement r&eacute;soudre. &Eacute;tant donn&eacute; que beaucoup des changements portent sur la syntaxe, c&#8217;est un bon point de d&eacute;part d&#8217;&eacute;tudier les nombreux changements de syntaxe de Python 3. (ex. <code>print</code> est maintenant une fonction, <code>`x`</code> ne fonctionne plus, <i class=baa>&amp;</i>tc.)

<p>La documentation autour de <a href=case-study-porting-chardet-to-python-3.html>l&#8217;&eacute;tude de cas : Portage de <code>chardet</code> &agrave; Python 3</a> sur mes tentatives (finalement payantes) de porter une biblioth&egrave;que non-triviale de Python 2 &agrave; Python 3, pourront peut-&ecirc;tre vous aider ou pas. La courbe d&#8217;apprentissage est assez raide, car il faut d&#8217;abord comprendre la biblioth&egrave;que, pour bien saisir pourquoi le portage a &eacute;chou&eacute; et comment je l&#8217;ai r&eacute;par&eacute;. Les principaux soucis tournaient autour des strings, ce qui nous am&egrave;ne &agrave; notre premier sujet&hellip;

<p>Les strings ! Par o&ugrave; commencer ? Python 2 avait les &#8220;strings&#8221; et les &#8220;strings Unicode.&#8221; Python 3 poss&egrave;de maintenant les &#8220;bytes&#8221; et les &#8220;strings.&#8221; Tout &ccedil;a pour dire que, toutes les strings sont maintenant des strings Unicode et si vous prend l&#8217;envie de g&eacute;rer un paquet de bytes, vous pourrez utiliser le nouveau type <code>bytes</code>. Python 3 ne va <em>jamais</em> convertir implicitement les strings en bytes (ou vice et versa), donc si vous n&#8217;&ecirc;tes pas s&ucirc;re de quel type vous g&eacute;rez &agrave; un moment, votre code risque tr&egrave;s certainement de planter. Lisez <a href=strings.html>le chapitre sur les Strings</a> pour plus de d&eacute;tails. 

<p>Le combat bytes vs. strings reviendra souvent &agrave; travers ce livre.

<ul>
<li>Dans le chapitre <a href=files.html>Fichiers</a>, vous apprendrez les diff&eacute;rences entre lire des fichiers en mode &#8220;binaire&#8221; et en mode &#8220;texte&#8221;. En effet, lire (et &eacute;crire !) des fichiers en mode texte, n&eacute;cessite de pr&eacute;ciser l&#8217;<code>encoding</code> &agrave; utiliser. De plus, certaines m&eacute;thodes utilis&eacute;es pour travailler avec des fichiers textes, comptent les caract&egrave;res et d&#8217;autres comptent les bytes. Donc, si votre code suppose qu&#8217;un caract&egrave;re &eacute;quivaut &agrave; un byte, ce dernier pourra &eacute;ventuellement planter sur des caract&egrave;res multi-byte,
<li>Dans le chapitre <a href=http-web-services.html>Web Services <abbr>HTTP</abbr></a>, le module <code>httplib2</code> recup&egrave;re les en-t&ecirc;tes et les donn&eacute;es via le protocole <abbr>HTTP</abbr>. Les en-t&ecirc;tes <abbr>HTTP</abbr> sont r&eacute;cup&eacute;r&eacute;es comme des strings, en revanche le corps <abbr>HTTP</abbr> de la requ&egrave;te est r&eacute;cup&eacute;r&eacute; en tant que bytes,
<li>Dans le chapitre <a href=serializing.html>S&eacute;rialisation des objets Python</a>, vous apprendrez pourquoi le module <code>pickle</code> de Python 3, d&eacute;finit un nouveau format de donn&eacute;es incompatible avec celui de Python 2. (indice : c&#8217;est &agrave; cause de bytes et de strings). Ainsi que, le support par Python 3 de la s&eacute;rialisation des objets depuis et vers le format <abbr>JSON</abbr>, qui ne poss&egrave;de m&ecirc;me pas de type <code>bytes</code>. Je vais vous montrer d&#8217;ailleurs comment g&eacute;rer &ccedil;a,
<li>Dans <a href=case-study-porting-chardet-to-python-3.html>l&#8217;&eacute;tude de cas : portage de <code>chardet</code> &agrave; Python 3</a>, c&#8217;est un sacr&eacute; bordel avec des bytes et des strings partout.
</ul>

<p>M&ecirc;me si vous ne voulez pas vous soucier de l&#8217;Unicode (mais vous vous en soucierez), vous souhaiterez s&ucirc;rement lire <a href=strings.html#formatting-strings>le formattage des strings avec Python 3</a>, qui a beaucoup &eacute;volu&eacute; aussi depuis Python 2.

<p>Les Iterators sont partout dans Python 3 et je les comprends bien mieux maintenant qu&#8217;il y a cinq ans, au moment o&ugrave; j'ai &eacute;crit &#8220;Plongez au c&oelig;ur de Python&#8221;. Il est imp&eacute;ratif que vous les compreniez aussi, car beaucoup de fonctions qui renvoyaient des listes sous Python 2, renvoient maintenant des Iterators dans Python 3. Au minimum, vous devriez lire <a href=iterators.html#a-fibonacci-iterator>la deuxi&egrave;me partie du chapitre sur les Iterators</a> et <a href=advanced-iterators.html#generator-expressions>la deuxi&egrave;me partie du chapitre sur les Iterators Avanc&eacute;s</a>.

<p>Sur demande du peuple, j&#8217;ai rajout&eacute; une annexe sur les <a href=special-method-names.html>Noms des m&eacute;thodes sp&eacute;ciales</a>, qui ressemble un peu <a href=http://www.python.org/doc/3.1/reference/datamodel.html#special-method-names>au chapitre &#8220;Data Model&#8221; de la documentation officielle Python</a> en bien mieux.

<p>Quand j&#8217;ai &eacute;crit &#8220;Plongez au c&oelig;ur de Python&#8221;, toutes les biblioth&egrave;ques XML disponibles &eacute;taient nazes. Ensuite Fredrik Lundh &eacute;crivit <a href=http://effbot.org/zone/element-index.htm>ElementTree</a>, qui n&#8217;est pas mal du tout. Le dieu Python dans sa grande sagesse <a href=http://docs.python.org/3.1/library/xml.etree.elementtree.html>incorpora ElementTree dans sa librairie standard</a> et maintenant c&#8217;est devenu la base de <a href=xml.html>mon nouveau chapitre XML</a>. Les anciennes fa&ccedil;ons de parser du XML existent toujours, mais vous devriez les &eacute;viter parce qu&#8217;elles sont vraiment pourries !

<p>Une autre nouveaut&eacute; dans Python, pas dans le langage lui-m&ecirc;me, mais plut&ocirc;t dans la communaut&eacute;, est l&#8217;&eacute;mergence des d&eacute;p&ocirc;ts de code comme <a href=http://pypi.python.org/>le Python Package Index</a> (PyPI). Maintenant Python vient avec des utilitaires pour packager votre code dans un format standard, le tout disponible sur le site <a href="http://pypi.python.org/pypi">PyPI</a>. Lisez <a href=packaging.html>Packager des biblioth&egrave;ques Python</a> pour avoir plus d&#8217;informations.

<p class=c>&copy; 2001&ndash;10 <a href=about.html>Mark Pilgrim</a>
<p class=c>&copy; 2010 <a href="http://bitbucket.org/ogirardot/diveintopython3-fr">Equipe de traduction fran&ccedil;aise</a>
